export default {
  Hague: `
    Чоловік каже: "Дом 47", на що водій таксі киває головою та каже "Принято", і починає їхати у визначеному напрямку.
    Чоловік раптово відчув слабкість у тілі.
    Типове для нього відчуття, до якого він звик за останні десять років.
    І що тепер... єдине, що у нього залишилося - це слабке і хворе тіло, яке після 6 годин без сну вже потребує відпочинку.
    Ні зв'язків, ні грошових рахунків, ні власних людей і навіть таксист, якого прислала довірена людина, поводить себе якось дивно.
    Від одних думок у чоловіка почала паморочитися голова, тому він вирішує піддатися сну і трохи відпочити в дорозі.
    Наступне, що він бачить - групу чоловіків і кілька жінок у костюмах з піджаками, які розмовляють з кількома чоловіками у військовій формі.
    Вони розмовляють дуже тихо, але чоловік ледве чує кілька слів на кшталт "Гааґа", "Ті інші" та "відповідне покарання".
    Потім один із солдатів показує пальцем у певному напрямку ліворуч від чоловіка.
    Чоловік дивиться туди і бачить машину, наповнену знайомими обличчями: Генерали, політики та керівники популярних ЗМІ в Росії, всі з порожніми поглядами, спрямованими в нікуди.
    Для цього малого, хворого чоловіка починається кінець його історії...
  `,
  Poison: ``,
  Revolver: `
    Чоловік кладе кулю в револьвер та пускає її собі в лоб зі словами 
    "Я не зміг, але на моє місце прийде інший, Heil Hitler!"
    На цьому історія цього малого, хворого чоловіка закінчується, а негативні наслідки його дій для майбутніх поколінь тільки починаються...
  `,
};
