import { Item } from "../../types";
import { NonUniqueRooms } from "../../types/story";

const REVOLVER: Item = {
  name: "Револьвер",
  description: "Старий німецький револьвер",
  image: "colt.png",
};

export const locations: NonUniqueRooms = {
  Кабінет: {
    name: "Кабінет",
    description: `
      Велика червона кімната із якимось чоловіком за столом. Місцевість невідома. 
      Серед тиші кімнати голосно цокає годинник на одній зі стін, заставленій шафами і картинами.
      У стінах немає вікон, лише сліпуче штучне світло, яке змушує хмуритися.
      Повсюду чутно легкий запах аміаку, який при спробі принюхатися змінюється на запах дезінфікуючих та миючих засобів, ніби хтось намагався позбавити сірі поверхні від усіх плям і запахів, ніби зішкребти історію приміщення.
      У центрі кімнати стоїть письмовий стіл з хаотично розкиданою купою паперів, частина з яких валяється на підлозі так, ніби їх хтось сердито скинув.
      Також одна з секцій столу відкрита і з неї видніється старий револьвер. Він порожній.
    `,
    actions: [
      {
        description: "Взяти револьвер зі столу",
        result: [
          {
            type: "ADD_ITEM",
            payload: {
              item: REVOLVER,
            },
          },
        ],
      },
      {
        description: "Прислухатися до годинника",
        result: [
          {
            type: "SHOW_TEXT",
            payload: {
              text: "Гнітюча атмосфера посилюється.",
            },
          },
          {
            type: "TAKE_DAMAGE",
            payload: {
              damage: 2,
            },
          },
        ],
      },
      {
        description: "Подивитись на стіни.",
        result: [
          {
            type: "SHOW_TEXT",
            payload: {
              text: "В кутку відніються блискучі пляшки з невідомими рідинами і порошкоподібними сумішами, але ніде не видно побутової техніки, ні комп'ютера, ні телевізора, ні навіть телефону.",
            },
          },
          {
            type: "ADD_ACTION",
            payload: {
              action: {
                description: "Підійти до пляшок",
                result: [
                  {
                    type: "SHOW_TEXT",
                    payload: {
                      text: "Пройшло 10 хвилин",
                    },
                  },
                  {
                    type: "RESTORE_HEALTH",
                    payload: {
                      health: 999,
                    },
                  },
                  {
                    type: "GET_BONUS_POINT",
                    payload: {},
                  },
                ],
              },
            },
          },
        ],
      },
      {
        description: "Прочитати рапорт",
        result: [
          {
            type: "SHOW_TEXT",
            payload: {
              text: "Чоловік дивиться на зміст звіту з порожнім і не здивованим виразом обличчя, наче бачить його вже в сотий раз.",
            },
          },
          {
            type: "SHOW_TEXT",
            payload: {
              text: "З першого абзацу першої сторінки видно, що кількість особистих нападів подвоїлась, грошей в воєнному бюджеті вже давно немає і всі території України відбиті.",
            },
          },
          {
            type: "TAKE_DAMAGE",
            payload: {
              damage: 2,
            },
          },
        ],
      },
      {
        description: "Вийти з кімнати (Коридор)",
        result: [
          {
            type: "SHOW_TEXT",
            payload: {
              text: "Ви вийшли з кімнати",
            },
          },
          {
            type: "CHANGE_LOCATION",
            payload: {
              newLocation: "Коридор",
            },
          },
        ],
      },
      {
        description: "Відкрити секретний прохід та спуститись в (бункер)",
        result: [
          {
            type: "SHOW_TEXT",
            payload: {
              text: "Після натискання певної кнопки, розташованої в столі, на місці однієї зі стін відкривався прохід зі сходами кудись вниз.",
            },
          },
          {
            type: "CHANGE_LOCATION",
            payload: {
              newLocation: "Бункер",
            },
          },
        ],
      },
    ],
  },
  Коридор: {
    name: "Коридор",
    description: `
      Відчинивши двері, чоловік опиняється в широкому, заставленому різними декораціями, але порожньому коридорі.
      Ні душі, схоже, що весь персонал покинув цю будівлю ще вранці.
    `,
    actions: [
      {
        description: "Піти наліво",
        result: [
          {
            type: "SHOW_TEXT",
            payload: {
              text: "Шлях завів у глухий кут, чоловік розвернувся та повернувся до коридору.",
            },
          },
        ],
      },
      {
        description: "Останній шанс повернутися назад (Бункер)",
        result: [
          {
            type: "SHOW_TEXT",
            payload: {
              text: "Чоловік повернувся до кімнати, де натиснув певну кнопку, розташовану в столі, яка відкрила потайний хід і почав спускатися.",
            },
          },
          {
            type: "CHANGE_LOCATION",
            payload: {
              newLocation: "Бункер",
            },
          },
        ],
      },
      {
        description: "Піти вперед на вулицю",
        result: [
          {
            type: "SHOW_TEXT",
            payload: {
              text: "Чоловік вийшов з будинку, підійшов до поруч стоячої машини та сів в неї.",
            },
          },
          {
            type: "ENDING",
            payload: {
              ending: "Hague",
            },
          },
        ],
      },
    ],
  },
  Бункер: {
    name: "Бункер",
    description: `
      Десь під землею в бункері.
      Чоловік спустився сходами в темний підвал, в бункер і зачинив за собою двері.
      Зазвичай чоловік відчував себе в бункері безпечніше і впевненіше, але після інциденту з нападом прибиральницi бункера його охопила параноя і він почав виганяти весь персонал в будівлях, де знаходився.
      У приміщенні панує морок і холод, а темрява і тиша, ніби тиснуть на вуха.
      Єдине, що можна побачити в бункері - невеликий підсвічений стенд, а трохи вище - велику карту світу з невідомими здалеку деталями.
      Але якщо придивитися, то біля стенду можна побачити... точно такі ж пляшки, як і нагорі!
    `,
    actions: [
      {
        description: "Подивитися на стенд",
        result: [
          {
            type: "SHOW_TEXT",
            payload: {
              text: "На підставці, виготовленій з дорогого червоного дуба і прикрашеній різноманітними візерунками, розміщені десятки медалей і орденів, опис яких дає зрозуміти, що якщо чоловік і володіє ними, то скоріше як колекціонер, ніж як нагороджений. Одна людина не могла отримати всі ці нагороди. Всі нагороди датовані з 1915 по 1945 роки за різні події та перемоги нацистів над США та іншими європейськими країнами, а посередині в рамці розміщено обрамлене фото самого Адольфа Гітлера, начебто кумира колекціонера. Поруч з фото же лежить одна куля.",
            },
          },
          {
            requirements: {
              item: {
                exist: true,
                name: REVOLVER.name,
              },
            },
            type: "ADD_ACTION",
            payload: {
              action: {
                description: "Попестити фото та взяти кулю",
                result: [
                  {
                    type: "SHOW_TEXT",
                    payload: {
                      text: 'Чоловік каже: "Я скоро до вас приєднаюся, вчителю" та бере кулю',
                    },
                  },
                  {
                    type: "GET_BONUS_POINT",
                    payload: {},
                  },
                  {
                    type: "ENDING",
                    payload: {
                      ending: "Revolver",
                    },
                  },
                ],
              },
            },
          },
          {
            requirements: {
              item: {
                exist: false,
                name: REVOLVER.name,
              },
            },
            type: "ADD_ACTION",
            payload: {
              action: {
                description: "Попестити фото та взяти отруту",
                result: [
                  {
                    type: "SHOW_TEXT",
                    payload: {
                      text: "Чоловік мовчки бере пляшку з отрутою і випиває її одним ковтком.",
                    },
                  },
                  {
                    type: "ENDING",
                    payload: {
                      ending: "Poison",
                    },
                  },
                ],
              },
            },
          },
        ],
      },
      {
        description: "Підійти до пляшок",
        result: [
          {
            type: "SHOW_TEXT",
            payload: {
              text: "Пройшло 10 хвилин.",
            },
          },
          {
            type: "GET_BONUS_POINT",
            payload: {},
          },
          {
            type: "RESTORE_HEALTH",
            payload: {
              health: 999,
            },
          },
        ],
      },
      {
        description: "Подивитися на мапу",
        result: [
          {
            type: "SHOW_TEXT",
            payload: {
              text: 'Карта світу, безумовно, сучасна, вона навіть має серійний код з датою виготовлення - 10 лютого 2022 року, але щось з нею не так, на ній відсутні кордони і вся земля намальована одним кольором - червоним. Якщо придивитися, то можна навіть побачити підпис "ПУТІНСЬКА ІМПЕРІЯ".',
            },
          },
        ],
      },
    ],
  },
};
